### Q1. List any five functions of the pandas library with execution.

1. read_csv(): Reads a CSV file and creates a DataFrame.
2. head(): Returns the first n rows of a DataFrame.
3. shape: Returns the dimensions (rows, columns) of the DataFrame.
4. groupby(): Groups the DataFrame by one or more columns, allowing operations to be applied on the grouped data.
5. sort_values(): Sorts the DataFrame based on specified column(s).

In [8]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [9]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
df.shape

(891, 12)

In [16]:
df2 = df.groupby('Pclass')

In [17]:
df2.sum()

/tmp/ipykernel_3586/1192336401.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df2.sum()

        PassengerId  Survived      Age  SibSp  Parch        Fare
Pclass
1             99705       136  7111.42     90     77  18177.4125
2             82056        87  5168.83     74     70   3801.8417
3            215625       119  8924.92    302    193   6714.6951

In [19]:
df.sort_values('Age')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [17]:
import pandas as pd

def reindex_dataframe(df):
    #  range index func Generate a new index starting from 1 and incrementing by 2
    new_index = pd.RangeIndex(start=1, step=2, stop=len(df) * 2) 
    # reset func Reset the existing index
    df = df.reset_index(drop=True)
    # Re-index func crete new index
    df = df.reindex(new_index,fill_value="0")
    return df


df = pd.DataFrame({'A': [10, 20, 30], 'B': [40, 50, 60], 'C': [70, 80, 90]})
# Re-index the DataFrame
df = reindex_dataframe(df)
print(df)

    A   B   C
1  20  50  80
3   0   0   0
5   0   0   0


### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should .calculate and print the sum of the first three values, which is 60.

In [22]:
#example 1
import pandas as pd
def calculate_sum(df,string):
    sum_values = df[string].head(3).sum() 
    print("Sum of the first three values:", sum_values)


df = pd.DataFrame({'Values': [10, 20, 30, 40, 50],
                  'A': [10, 20, 30,3,3],
                   'B': [40, 50, 60,32,56], 
                   'C': [70, 80, 90,89,0]
                  })
string = "Values"
# Calculate and print the sum of the first three values
calculate_sum(df,string)

Sum of the first three values: 60

In [51]:
#example 2
df['Values'].head(3).sum()

60

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [56]:
#example 1
import pandas as pd

def add_word_count(df):
    df['Word_Count'] = df['Text'].apply(lambda x: len(x.split())) 
    return df

df = pd.DataFrame({'Text': ['Hello Shan, how are you?', 'I am doing great!', 'Python is awesome']})
df = add_word_count(df)
print(df)

#example 2
df['Char lenth'] = df['Text'].apply(lambda x:len(x))
print(df)

                       Text  Word_Count
0  Hello Shan, how are you?           5
1         I am doing great!           4
2         Python is awesome           3
                       Text  Word_Count  Char lenth
0  Hello Shan, how are you?           5          24
1         I am doing great!           4          17
2         Python is awesome           3          17

### Q5. How are DataFrame.size() and DataFrame.shape() different?

#### DataFrame.size(): This method returns the total number of elements in the DataFrame, which is equal to the product of the number of rows and the number of columns.
#### DataFrame.shape(): This method returns a tuple representing the dimensions of the DataFrame in the format (rows, columns).

In [58]:
print(df.size)
print(df.shape)

9
(3, 3)

### Q6. Which function of pandas do we use to read an excel file?

#### Ans read_excel() function is used to read the Excel file

## - example
#### import pandas as pd
#### Read the Excel file
#### df = pd.read_excel('data.xlsx')
#### Display the DataFrame
#### print(df)

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.
### The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [85]:
df = pd.DataFrame({'Email': ['john.doe@example.com', 'shankhan23@gmail.com', 'arshkhan76@gmail.com']})
df['Username'] = df['Email'].apply(lambda x: x.split("@")[0])
df

                  Email    Username
0  john.doe@example.com    john.doe
1  shankhan23@gmail.com  shankhan23
2  arshkhan76@gmail.com  arshkhan76

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.For example, if df contains the following values:

#####     A B C
##### 0 3 5 1
##### 1 8 2 7
##### 2 6 9 4
##### 3 2 3 5
##### 4 9 1 2
#### Your function should select the following rows: A B C
##### 1 8 2 7
##### 4 9 1 2
#### The function should return a new DataFrame that contains only the selected rows.

In [93]:
import pandas as pd

df = pd.DataFrame({"A": [3, 8, 6, 2, 9],
                  "B": [5, 2, 9, 3, 1],
                   "C": [1, 7, 4, 5, 2]
                  })
df1 = df[(df['A'] > 5) & (df['B'] < 10)]
df1

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [94]:
import pandas as pd

def calculate_statistics(df):
    mean_value = df['Values'].mean()     # Calculate the mean of the 'Values' column
    median_value = df['Values'].median()  # Calculate the median of the 'Values' column
    std_value = df['Values'].std()       # Calculate the standard deviation of the 'Values' column

    print("Mean:", mean_value)
    print("Median:", median_value)
    print("Standard Deviation:", std_value)


df = pd.DataFrame({'Values': [10, 20, 30, 40, 50,60,70,80,90,100]})
# Calculate and print the statistics
calculate_statistics(df)

Mean: 55.0
Median: 55.0
Standard Deviation: 30.276503540974915

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [98]:
def moving_average(df):
    window_size = 7  
    df['MovingAverage'] = df['Sales'].rolling(window=window_size, min_periods=1).mean()
    return df


df = pd.DataFrame({'Date': pd.date_range('2022-01-01', periods=10), 
                   'Sales': [33, 75, 20, 25, 38, 35, 40, 49,15, 55]}
                 )

df = moving_average(df)
df

        Date  Sales  MovingAverage
0 2022-01-01     33      33.000000
1 2022-01-02     75      54.000000
2 2022-01-03     20      42.666667
3 2022-01-04     25      38.250000
4 2022-01-05     38      38.200000
5 2022-01-06     35      37.666667
6 2022-01-07     40      38.000000
7 2022-01-08     49      40.285714
8 2022-01-09     15      31.714286
9 2022-01-10     55      36.714286

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

##### For example, if df contains the following values:
##### Date
##### 0 2023-01-01
##### 1 2023-01-02
##### 2 2023-01-03
##### 3 2023-01-04
##### 4 2023-01-05
##### Your function should create the following DataFrame:

##### Date Weekday
##### 0 2023-01-01 Sunday
##### 1 2023-01-02 Monday
##### 2 2023-01-03 Tuesday
##### 3 2023-01-04 Wednesday
##### 4 2023-01-05 Thursday
##### The function should return the modified DataFrame.

In [133]:
import pandas as pd

def weekday_column(df):
    # df['Date'].dt.dayofweek returns the day of the week as an integer, where Monday is represented by 0, Tuesday by 1, and so on. 
    custom_day_names = ['Sunday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday']
    # Map the day of the week to the custom day names with Sunday as the first day
    df['Weekday'] = df['Date'].dt.dayofweek.map(lambda x: custom_day_names[(x + 2) % 7])

    return df

df = pd.DataFrame({'Date': pd.date_range('2022-01-01', periods=5)})
df = weekday_column(df)
print(df)

        Date    Weekday
0 2022-01-01   Saturday
1 2022-01-02     Sunday
2 2022-01-03     Monday
3 2022-01-04    Tuesday
4 2022-01-05  Wednesday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [134]:
import pandas as pd

def select_rows_between_dates(df):
    start_date = '2023-01-01'
    end_date = '2023-01-31'
    mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)  # Create a boolean mask
    selected_rows = df[mask]  # Apply the mask to select rows

    return selected_rows

# Example usage:
df = pd.DataFrame({'Date': pd.date_range('2022-12-20', periods=50)})
selected_df = select_rows_between_dates(df)
print(selected_df)

         Date
12 2023-01-01
13 2023-01-02
14 2023-01-03
15 2023-01-04
16 2023-01-05
17 2023-01-06
18 2023-01-07
19 2023-01-08
20 2023-01-09
21 2023-01-10
22 2023-01-11
23 2023-01-12
24 2023-01-13
25 2023-01-14
26 2023-01-15
27 2023-01-16
28 2023-01-17
29 2023-01-18
30 2023-01-19
31 2023-01-20
32 2023-01-21
33 2023-01-22
34 2023-01-23
35 2023-01-24
36 2023-01-25
37 2023-01-26
38 2023-01-27
39 2023-01-28
40 2023-01-29
41 2023-01-30
42 2023-01-31

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

### Ans: Importing "pandas" is the foremost requirement.